src_ext/DataProcessors/УЗ_ИзменениеУроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УЗ_ИзменениеУроков</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_ext/Documents/УЗ_Урок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_Урок</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Расходы</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_РасчетыПоЗарплате</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Педагог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоПедагогу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДомашнееЗадание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаУрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписатьОплату</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Явка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Причина</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДисконтнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонусов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачисленияПедагогу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИзменять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/DataProcessors/УЗ_ИзменениеУроков/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НайтиУроки(Команда)
	НайтиУрокиНаСервере();
КонецПроцедуры
Процедура НайтиУрокиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Уроки.Ссылка КАК Урок,
		|	Уроки.НомерСтроки КАК НомерСтроки,
		|	Уроки.СписатьОплату КАК СписатьОплату,
		|	Уроки.Явка КАК Явка,
		|	Уроки.Ученик КАК Ученик,
		|	Уроки.Абонемент КАК Абонемент,
		|	Уроки.Тариф КАК Тариф,
		|	Уроки.Скидка КАК Скидка,
		|	Уроки.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ЛОЖЬ КАК ЯвкаИзменено,
		|	ЛОЖЬ КАК СписатьОплатуИзменено,
		|	ЛОЖЬ КАК УдалитьУченика,
		|	"""" КАК Описание
		|ИЗ
		|	Документ.УЗ_Урок.Ученики КАК Уроки
		|ГДЕ
		|	Уроки.Ссылка.Проведен
		|	И Уроки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Уроки.Ученик В ИЕРАРХИИ(&Ученики)
		|	И Уроки.Ссылка.ПредметОбучения = &ПредметОбучения
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НомерСтроки)
		|ПО
		|	Урок";
	
	Запрос.Параметры.Вставить("ДатаНачала",Период.ДатаНачала);
	Запрос.Параметры.Вставить("ДатаОкончания",Период.ДатаОкончания);
	
	Если Ученики.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Уроки.Ученик В ИЕРАРХИИ(&Ученики)","");
	Иначе 		
		Запрос.Параметры.Вставить("Ученики",Ученики);
	КонецЕсли;
	
	Если ПредметОбучения.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Уроки.Ссылка.ПредметОбучения = &ПредметОбучения","");
	Иначе 		
		Запрос.Параметры.Вставить("ПредметОбучения",ПредметОбучения);
	КонецЕсли;
	
	ПромДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ПромДерево, "ДеревоУроков");
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоУроковСписатьОплатуПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоУроков.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Ученик) Тогда // Это корень
		 ИзменитьКорень(ТекДанные.Урок, Истина);
	КонецЕсли;
	
КонецПроцедуры 
&НаКлиенте
Процедура ИзменитьКорень(Урок, СписатьОплату)
	
	ЭлементыДерева = ДеревоУроков.ПолучитьЭлементы();
	Для Каждого КорнЭл из ЭлементыДерева Цикл
		
		Если КорнЭл.Урок <> Урок Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементыСтрокиДерева = КорнЭл.ПолучитьЭлементы();
		Для Каждого ЭлСтроки из  ЭлементыСтрокиДерева цикл
			Если СписатьОплату Тогда
				ЭлСтроки.СписатьОплату = КорнЭл.СписатьОплату;
			Иначе
				ЭлСтроки.Явка = КорнЭл.Явка;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоУроковЯвкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДеревоУроков.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.Ученик) Тогда // Это корень
		ИзменитьКорень(ТекДанные.Урок, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, "Изменить уроки?", Режим, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ПрименитьИзменения();
	КонецЕсли;
КонецПроцедуры    
	
//Отметки каждого урока уходят в Обработки.УЗ_ИзменениеУроков.ИзменитьОтметкиУрока: там сравнение с
//документом и перепроведение (раньше — обычная запись без движений и признаки «изменено» из исходных значений).
Процедура ПрименитьИзменения()
	
	Древо = РеквизитФормыВЗначение("ДеревоУроков");
	
	Для Каждого СтрокаУрока Из Древо.Строки Цикл
		
		Изменения = Новый Массив;
		Для Каждого СтрокаУченика Из СтрокаУрока.Строки Цикл
			Изменения.Добавить(Новый Структура("Ученик, СписатьОплату, Явка",
				СтрокаУченика.Ученик, СтрокаУченика.СписатьОплату, СтрокаУченика.Явка));
		КонецЦикла;
		
		Итог = Обработки.УЗ_ИзменениеУроков.ИзменитьОтметкиУрока(СтрокаУрока.Урок, Изменения);
		СтрокаУрока.Описание = Итог.Текст;
		Для Каждого СтрокаУченика Из СтрокаУрока.Строки Цикл
			СтрокаУченика.СписатьОплатуИзменено = Итог.Успех И Итог.ИзмененаОплата.Найти(СтрокаУченика.Ученик) <> Неопределено;
			СтрокаУченика.ЯвкаИзменено = Итог.Успех И Итог.ИзмененаЯвка.Найти(СтрокаУченика.Ученик) <> Неопределено;
		КонецЦикла;
		Если НЕ Итог.Успех Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = '%1: %2'"), СтрокаУрока.Урок, Итог.Текст);
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Древо, "ДеревоУроков");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
		Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьСписатьОплату(Команда)
	ОбойтиДеревоНаСервере2(Истина, Неопределено);	
КонецПроцедуры
Процедура ОбойтиДеревоНаСервере2(СписатьОплату, Явка)
	
	ЭлементыДерева = ДеревоУроков.ПолучитьЭлементы();
	Для Каждого элемента из  ЭлементыДерева цикл
		
		
		Если СписатьОплату <> Неопределено ТОгда
			элемента.СписатьОплату = СписатьОплату;
		КонецЕсли;		
		Если Явка <> Неопределено ТОгда
			элемента.Явка = Явка;
		КонецЕсли;

		
		ЭлементыСтрокиДерева = элемента.ПолучитьЭлементы();
		Для Каждого ЭлСтроки из  ЭлементыСтрокиДерева цикл
			
			Если СписатьОплату <> Неопределено ТОгда
				ЭлСтроки.СписатьОплату = СписатьОплату;
			КонецЕсли;  			
			Если Явка <> Неопределено ТОгда
				ЭлСтроки.Явка = Явка;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСписатьОплату(Команда)
	ОбойтиДеревоНаСервере2(Ложь, Неопределено);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЯвки(Команда)
	ОбойтиДеревоНаСервере2(Неопределено, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура СнятьЯвки(Команда)
	ОбойтиДеревоНаСервере2(Неопределено, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере(); 		
КонецПроцедуры

Процедура ПериодПриИзмененииНаСервере()
	Древо = РеквизитФормыВЗначение("ДеревоУроков");
	Древо.Строки.Очистить();
	ЗначениеВРеквизитФормы(Древо, "ДеревоУроков");
КонецПроцедуры
